[frmMain]
mnuLanguage.Caption=Language

pmnuExitTheSystem.Caption=Exit the system

mnuSystemSettings.Caption=System settings
mnuParameterSetting.Caption=Parameter setting
mnuBootUp.Caption=Boot up
mnuExitTheSystem.Caption=Exit the system

mnuReportTools.Caption=Report tools
mnuReportDesign.Caption=Report design

mnuPrintLog.Caption=View print log


mnuJsonTools.Caption=JSON validation tool（ bejson.com )
mnuBase64.Caption=Base64 and image conversion
mnuUrlEncode.Caption=URL encoding / decoding
mnuSSLTools.Caption=SSL certificate format conversion tool
mnuOpenTheRootDirectory.Caption=Open the root directory
mnuOpenReportDirectory.Caption=Open report directory
mnuOpenLogDirectory.Caption=Open log directory
mnuOpenTheOutputfileDirectory.Caption=Open the output file directory
mnuWindowDisplay.Caption=Window display
mnuHttpPrint.Caption=HTTP printing
mnuMqttPrint.Caption=Mqtt printing
mnuCamera.Caption=camera
mnuIdCard.Caption=ID
mnuGridreport.Caption=Gridreport
mnuFastreport.Caption=Fastreport
mnuReportmachine.Caption=Reportmachine
mnuSystemHelp.Caption=System help
mnuAboutUs.Caption=About us

ts_http_print.Caption=HTTP printing
lblPort.Caption=port
rb_print.Caption=Printing
rb_Preview.Caption=preview
ButtonStart.Caption=start-up
ButtonStop.Caption=stop it

ts_mqtt_print.Caption=Mqtt printing
gb_mqtt.Caption=Mqtt server
lbl_mqtt_server_address.Caption=address
lbl_mqtt_server_port.Caption=port
lbl_mqtt_server_username.Caption=user name
lbl_mqtt_server_userpwd.Caption=password
lbl_mqtt_server_subscribe_topic.Caption=Subscribe to topics
lbl_mqtt_server_print_verification_code.Caption=Print verification code
ButtonStart_mqtt.Caption=start-up
ButtonStop_mqtt.Caption=stop it

ts_camera.Caption=camera
lbl_camera_device_list.Caption=Equipment list
lbl_camera_resolution.Caption=resolving power
btn_open_camera.Caption=Start the camera
btn_close_camera.Caption=Turn off the camera
chk_auto_open_camera.Caption=Auto start camera
chk_pal_b.Caption=Prevent flash screen
chk_auto_top.Caption=Top Form (always on top)

ts_idcard.Caption=ID
lbl_idcard_name.Caption=full name
lbl_idcard_sex.Caption=Gender
lbl_idcard_nation.Caption=nation
lbl_idcard_birthday.Caption=date of birth
lbl_idcard_id.Caption=ID number
lbl_idcard_org.Caption=signing and issuing organization
lbl_idcard_addr.Caption=address
lbl_idcard_begin.Caption=Start of validity
lbl_idcard_end.Caption=End of validity
lbl_idcard_type.Caption=Equipment type
btn_idcard_read.Caption=read
lbl_idcard_msg.Caption=Message tips:

[frmAbout]
btnOk.Caption=OK
Caption=about

[LanguageString]
ini_NeedRegister=Too many printing times, please restart the print plug-in or purchase OEM version
ini_NoToken=Token value does not exist
ini_ReadIdCardError=Message prompt: card reading failed!
ini_GetPrinterList=Get printer list
ini_CreateDir=Create directory
ini_FailPleaseCheck=Failed, please check
ini_PrintFailPleaseCheck=Printing failed, please check
ini_ReportFileNotExist=The report file does not exist
ini_DownLoadError=Download error
ini_JsonFormatError=JSON format error
ini_PrintingTimeoutPleaseCheck=Printing timeout, please check
ini_PictureFormatError=The picture format is not correct
ini_PdfFileNotExist=Pdf file does not exist
ini_PicFileNotExist=Pic file does not exist
ini_This=The
ini_NotSupport=I won't support it
ini_InterfaceCallFailed=Interface call failed
ini_CameraNotActivated=Camera not activated
ini_SelectFolder=Select Folder
ini_MinutesMustBeAnInteger=Minutes must be an integer
ini_MinutesMustBeGreaterThanZero=Minutes must be greater than zero
ini_SelfStartingClientNameCannotBeEmpty=Self starting client name cannot be empty


ini_PdfFileCannotOpen=Pdf file cannot be opened
ini_LicenseKeyInvalid=The license key is invalid 


ini_PicFileCannotOpen=Pic file cannot be opened
ini_UnableInitializePrinter=Unable to initialize printer
ini_PicPrint=Pic printing
ini_PaperSize=Paper size
ini_CustomMM=custom(MM)
ini_Width=width
ini_Height=height
ini_PrintingDirection=Printing direction
ini_landscape=transverse
ini_portrait=vertical
ini_MarginMM=Margins(MM)
ini_Left=Left
ini_Right=right
ini_Top=Top
ini_Bottom=Bottom
ini_Center=Center
ini_VerticalPos=Vertical position
ini_HorizontalPos=Horizontal position
ini_Copys=Number of copies
ini_DocumentTitle=document title
ini_PrinterName=Printer name
ini_PageZoom=Page zoom
ini_Normal=Determine the print size from the original image DPI (i.e. create a true size copy)
ini_FitToPage=Stretch the image to fit the page while respecting its scale
ini_FitToPageStretch=Stretch the image to fit the page, ignoring scale
ini_FillPage=Stretch the image to fill the entire page (based on its scale)
ini_SpecifiedSize=Prints at the absolute size specified by the absolute width and height parameters
ini_MultiplePages=Print images (posters) on multiple pages with counts specified by absolute width and absolute height parameters
ini_SpecWidth=Absolute width
ini_SpecHeight=Absolute height
ini_LoadPic=Load Images
ini_ConfirmPrinting=Confirm printing





ini_PrintLog=print log
ini_Date=date
ini_Refresh=refresh
ini_OpenLogDirectory=Open log directory
ini_OpenOutputFileDirectory=open output file directory
ini_ViewCustomFile=view custom file
ini_LogList=log list
ini_LogContent=log content
ini_PdfFile=PDF file
ini_Directory=directory
ini_NotExist=does not exist





ini_ReportDesign=Report design
ini_DoubleClickToOpenTheReportFile=Double click to open the report file
ini_NewlyAdded=add
ini_Modify=modify
ini_Delete=delete
ini_Copy=copy
ini_ReportDoesNotExist=Report does not exist
ini_To=To
ini_Error=error
ini_InTheListBelow_selectTheReportFileYouWantToModify=In the list below, select the report file you want to modify
ini_TestReport=Test report
ini_AreYouSureYouWantToDelete=Are you sure you want to delete
ini_DeleteConfirmation=Delete confirmation
ini_YouHaveChosenNotToDelete=You have chosen not to delete
ini_ReportNameEn=Report name
ini_ReportNameAlias=Report name (alias)
ini_VersionNumber=Version number
ini_FileNameSuffixMustBe=File name suffix must be
ini_Currently=Currently
ini_TheFileNameAlreadyExists=The file name already exists
ini_ReportInfo=Report information




ini_NoJsonFile=The JSON file is missing
ini_PrintErrorJsonError=Printing failed, JSON format error
ini_MustBe=Must be
ini_Or=perhaps
ini_ReportName=Report name
ini_CannotBeEmpty=Cannot be empty
ini_MustBeIntOrFloat=Must be a decimal or integer type
ini_DeleteLocalReportFile=Delete local report file
ini_DownLoadReportFileToLocal=Download remote report to local
ini_DownLoadReportFileError=Error downloading report file
ini_DownLoadComplete=Download complete
ini_EditLocalReportVersion=Modify local report version number
ini_CreateReportFile=Create report file
ini_PrintCopys=Number of copies printed
ini_MustBeInt=Must be an integer type
ini_MustBeGreaterThanOrEqualTo=Must be greater than or equal to zero
ini_DetermineIfThePrinterExists=Determine if the printer exists
ini_Printer=printer
ini_NotExistPayAttentionToCaseAndSpace=No, please pay attention to case and space
ini_SetRightOffset=Set right offset
ini_MustBeFloat=Must be a floating point type
ini_SetBottomOffset=Set base offset
ini_MustBeOneOrZero=Must be 1 or 0
ini_SetComponent=Set part box
ini_Component=Component box
ini_ControlToArrayError=Error converting control to array
ini_LoadPicError=Error loading picture
ini_FormatError=Incorrect format
ini_Parameter=parameter
ini_ParameterToArrayError=Error converting parameter to array
ini_Field=field
ini_FieldToArrayError=Error converting Field to array
ini_AFieldToArrayError=Error converting AField to array
ini_BFieldToArrayError=Error converting BField to array
ini_CFieldToArrayError=Error converting CField to array
ini_DFieldToArrayError=Error converting DField to array
ini_EFieldToArrayError=Error converting EField to array
ini_FFieldToArrayError=Error converting FField to array
ini_GFieldToArrayError=Error converting GField to array
ini_HFieldToArrayError=Error converting HField to array
ini_IFieldToArrayError=Error converting IField to array
ini_JFieldToArrayError=Error converting JField to array
ini_DataRow=data row
ini_DataToArrayError=Error converting Data to array
ini_ADataToArrayError=Error converting AData to array
ini_BDataToArrayError=Error converting BData to array
ini_CDataToArrayError=Error converting CData to array
ini_DDataToArrayError=Error converting DData to array
ini_EDataToArrayError=Error converting EData to array
ini_FDataToArrayError=Error converting FData to array
ini_GDataToArrayError=Error converting GData to array
ini_HDataToArrayError=Error converting HData to array
ini_IDataToArrayError=Error converting IData to array
ini_JDataToArrayError=Error converting JData to array
ini_SetOffsetValue=Set offset value
ini_SetPrinterName=Set printer name
ini_ExportFileYes=Do you want to export the file, yes
ini_ExportFileName=Export file name
ini_ExportComplete=Export complete
ini_PreviewComplete=Preview complete
ini_PrintComplete=Finished printing
ini_LoadReport=Load Report
ini_ADataToArraySuccess=AData converted to array successfully
ini_BDataToArraySuccess=BData converted to array successfully
ini_CDataToArraySuccess=CData converted to array successfully
ini_DDataToArraySuccess=DData converted to array successfully
ini_EDataToArraySuccess=EData converted to array successfully
ini_FDataToArraySuccess=FData converted to array successfully
ini_GDataToArraySuccess=GData converted to array successfully
ini_HDataToArraySuccess=HData converted to array successfully
ini_IDataToArraySuccess=IData converted to array successfully
ini_JDataToArraySuccess=JData converted to array successfully



ini_NoClientID=There is no value for ClientID
ini_ClientIDEmpty=ClientID cannot be empty
ini_PrinteridWrong=Printerid is not right
ini_PrinterpwdWrong=Printerpwd is wrong
ini_MethodWrong=Incorrect method
ini_PingSuccessful=Ping successful
ini_PingTimeout=Ping timeout
ini_ConnectionResults=Connection results
ini_subscribeResultMessageID=Subscription result, message ID
ini_UnsubscribeResultMessageID=Unsubscribe result, message ID
ini_Received_release_confirmation_QoS_1_message_ID=Received release confirmation QoS 1, message ID
ini_Receive_release_confirmation_step_1_of_QoS_2_message_ID=Receive release confirmation step 1 of QoS 2, message ID
ini_Receive_release_confirmation_step_3_of_QoS_2_message_ID=Receive release confirmation step 3 of QoS 2, message ID
ini_Receive_release_confirmation_step_2_of_QoS_2_message_ID=Receive release confirmation step 2 of QoS 2, message ID
ini_ConnectionTimedOut=connection timed out
ini_PublishingTimeout=Publishing timeout
ini_MessageID=Message ID
ini_Topic=theme
ini_Content=content
ini_CameraOn=Camera on
ini_OpenFailed=Open failed
ini_NoVideoDevicesWereFound=No video devices were found
ini_Stopped=Stopped
ini_CameraStartFailed=Camera start failed
ini_CameraOff=Camera off
ini_Disconnect=Disconnect
ini_Started=Started
ini_Failed_to_start_Please_try_another_port=Failed to start. Please try another port
ini_Minimum_desktop_requirements_Windows_Vista=Minimum desktop requirements: Windows Vista
ini_Minimum_server_requirements_Windows_Server_2008=Minimum server requirements: Windows Server 2008


ini_Table_structure_field_type=Table structure field type ftblob (Base64 format), ftstring, ftinteger, ftboolean, ftfloat, ftcurrency, ftdatetime,
ini_size_ftString_ftInteger_ftBlob=Size (ftstring is set to the actual length, others are set to 0, for example, ftinteger ftblob is set to 0)
ini_Currently_10_tables_are_supported=Currently, 10 tables abcdefghij are supported. For example, table a contains afield adata until table J contains jfield jdata


ini_ParameterSetting=Parameter setting
ini_Log_save_path_if_empty_the_default_is_log_directory=Log save path (if empty, the default is log directory)
ini_Clear_log_on_startup=Clear log on startup
ini_Clear_log_on_exit=Clear log on exit
ini_In_operation_every=During operation, empty once every XX minutes
ini_Save_settings=Save settings
ini_journal=journal
ini_report_form=report form
ini_Report_template_path_empty_default_report_directory=Report template path (empty default report directory)
ini_Export_file_path_empty_default_export_directory=Export file path (empty default export directory)
ini_Export_file_format_blank_default_PDF_format=Export file format (blank, default PDF format)
ini_Enable_token=Enable token
ini_Token_list_one_for_each_line_similar_to_white_list=Token list (one for each line, similar to white list)
ini_other=other
ini_Minimize_after_startup=Minimize after startup
ini_Customize_the_client_name_so_that_it_can_start_multiple_clients=Customize the client name so that it can start multiple clients





ini_URL_encoding_decoding=URL encoding / decoding
ini_URLEncode=URLEncode
ini_URLDecode=URLDecode decoding






ini_Base64_and_image_conversion=Base64 and image conversion
ini_exceed_100k=In order to balance the efficiency in the production environment, generally a single image file should not exceed 100k.
ini_Base64_string=Base64 string
ini_paste=paste
ini_Turn_to_picture=Turn to picture
ini_picture=picture







ini_Connection=connect
ini_write_log=Generation Log